In [1]:
#!pip install pandas sqlalchemy pyodbc

In [4]:
import pandas as pd

In [5]:
from sqlalchemy import create_engine

server = 'localhost'  # o '127.0.0.1'
database = 'Bitdata'

# Crear el motor de conexión
engine_local = create_engine(f'mssql+pyodbc://@{server}/{database}?driver=ODBC+Driver+17+for+SQL+Server&Trusted_Connection=yes')

#
try:
    with engine_local.connect() as connection:
        print("Conexión exitosa")
except Exception as e:
    print(f"Error al conectar: {e}")

Conexión exitosa

In [6]:
from sqlalchemy import text
def runQuery_local(sql):
    result = engine_local.connect().execute((text(sql)))
    return pd.DataFrame(result.fetchall(), columns=result.keys())

In [7]:
query="""
SELECT top 3 * FROM Marcas
"""
df1= runQuery_local(query)
df1

   ID     Marca
0   1    Ducati
1   2  Kawasaki
2   3     Honda

In [ ]:
az= 'C:\Users\Admin\BOOTCAMP-DS-2024-I\BitRepositorio\BitRepo\Dataset\Marcas.csv'
df=pd.read_csv(az,sep=';')
df.to_sql('Marcas', con=engine_local, if_exists='append', index=False)

In [8]:
query="""
SELECT * FROM Marcas
"""
df1= runQuery_local(query)
df1

   ID     Marca
0   1    Ducati
1   2  Kawasaki
2   3     Honda
3   4    Yamaha
4   5    Ducati
5   6       Akt
6   7       Tvs

In [9]:
query="""
SELECT * FROM Modelos
"""
df1= runQuery_local(query)
df1

   ID                     Modelo
0   1                Panigale V4
1   2                  Ninja H2R
2   3  CBR1100XX Super Blackbird
3   4                     YZF-R1
4   5                      1098s

In [10]:
query="""
SELECT * FROM Modelos WHERE Modelo LIKE '%H2%'
"""
df1= runQuery_local(query)
df1

   ID     Modelo
0   2  Ninja H2R

In [11]:
query="""
SELECT 
    m.ID AS ModeloID,
    m.Modelo,
    r.ID AS MarcaID,
    r.Marca,
    c.ID AS CaracteristicaID,
    c.Cilindraje,
    c.Potencia,
    c.Caracteristicas
FROM 
    [Bitdata].[dbo].[Modelos] m
INNER JOIN 
    [Bitdata].[dbo].[Marcas] r ON m.ID = r.ID  
INNER JOIN 
    [Bitdata].[dbo].[Caracteristicas] c ON m.ID = c.ID  

"""
df1= runQuery_local(query)
df1

,ModeloID,Modelo,MarcaID,Marca,CaracteristicaID,Cilindraje,Potencia,Caracteristicas
0,1,Panigale V4,1,Ducati,1,1103,214,"Motor Desmosedici Stradale V4, modos de conduc..."
1,2,Ninja H2R,2,Kawasaki,2,998,310,"Motor sobrealimentado, diseño futurista"
2,3,CBR1100XX Super Blackbird,3,Honda,3,1137,161,"Chasis de aluminio, velocidad máxima de 310 km/h"
3,4,YZF-R1,4,Yamaha,4,998,172,"Refrigeración líquida, inyección electrónica"
4,5,1098s,5,Ducati,5,1099,160,"Chasis tubular de acero, capacidad de combusti..."

In [17]:
from sqlalchemy import text
def runQuery_exe(sql):
    engine_local.connect().execute((text(sql)))
    print("Actualizado")

In [18]:
query="""
UPDATE Modelos SET Modelo = 'YZF-R1000' WHERE Modelo = 'YZF-R1'
"""
runQuery_exe(query)

Actualizado

In [19]:
query="""
SELECT * FROM Modelos
"""
df1= runQuery_local(query)
df1

   ID                     Modelo
0   1                Panigale V4
1   2                  Ninja H2R
2   3  CBR1100XX Super Blackbird
3   4                  YZF-R1000
4   5                      1098s